Revit 2027 API
Toposolid.CreateSubDivision(Document, IList<CurveLoop>) Method
 Creates a Toposolid subdivision element with the current Toposolid as its host, using the default Toposolid type as the type of the new subdivision.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Toposolid CreateSubDivision(
	Document document,
	IList<CurveLoop> profiles
)
Public Function CreateSubDivision (
	document As Document,
	profiles As IList(Of CurveLoop)
) As Toposolid
public:
Toposolid^ CreateSubDivision(
	Document^ document,
	IList<CurveLoop^>^ profiles
)
member CreateSubDivision :
        document : Document *
        profiles : IList<CurveLoop> -> Toposolid
Parameters
document Document
 The document in which the new Toposolid is created.
profiles IList<CurveLoop>
 An array of planar curve loops that represent the profiles of the Toposolid.
Return Value
Toposolid
 The Toposolid subdivision object.
Exceptions
Exception | Condition
ArgumentException |  The input curve loops cannot compose a valid boundary, that means: the "curveLoops" collection is empty; or some curve loops intersect with each other; or each curve loop is not closed individually; or each curve loop is not planar; or each curve loop is not in a plane parallel to the horizontal(XY) plane; or input curves contain at least one helical curve.
ArgumentNullException |  A non-optional argument was null
Remarks
 By using this method, a default Toposolid type will be used as the element type.
See Also
Reference
Toposolid Class
CreateSubDivision Overload
Autodesk.Revit.DB Namespace